In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("spam_ham_dataset.csv")

In [4]:
data.describe()

        Unnamed: 0    label_num
count  5171.000000  5171.000000
mean   2585.000000     0.289886
std    1492.883452     0.453753
min       0.000000     0.000000
25%    1292.500000     0.000000
50%    2585.000000     0.000000
75%    3877.500000     1.000000
max    5170.000000     1.000000

In [5]:
data.head(5)

,Unnamed: 0,label,text,label_num
0,605,ham,Subject: enron methanol ; meter # : 988291\r\n...,0
1,2349,ham,"Subject: hpl nom for january 9 , 2001\r\n( see...",0
2,3624,ham,"Subject: neon retreat\r\nho ho ho , we ' re ar...",0
3,4685,spam,"Subject: photoshop , windows , office . cheap ...",1
4,2030,ham,Subject: re : indian springs\r\nthis deal is t...,0

In [6]:
data.columns

Index(['Unnamed: 0', 'label', 'text', 'label_num'], dtype='object')

In [7]:
data.drop(['Unnamed: 0'], axis=1, inplace=True)

In [8]:
data.head(5)

  label                                               text  label_num
0   ham  Subject: enron methanol ; meter # : 988291\r\n...          0
1   ham  Subject: hpl nom for january 9 , 2001\r\n( see...          0
2   ham  Subject: neon retreat\r\nho ho ho , we ' re ar...          0
3  spam  Subject: photoshop , windows , office . cheap ...          1
4   ham  Subject: re : indian springs\r\nthis deal is t...          0

In [9]:
data.drop(['label'],axis=1,inplace=True)

In [10]:
data.head(5)

                                                text  label_num
0  Subject: enron methanol ; meter # : 988291\r\n...          0
1  Subject: hpl nom for january 9 , 2001\r\n( see...          0
2  Subject: neon retreat\r\nho ho ho , we ' re ar...          0
3  Subject: photoshop , windows , office . cheap ...          1
4  Subject: re : indian springs\r\nthis deal is t...          0

In [11]:
x = data['text']

In [12]:
y = data['label_num']

In [13]:
y.shape

(5171,)

In [14]:
x.shape

(5171,)

In [15]:
data.describe()

         label_num
count  5171.000000
mean      0.289886
std       0.453753
min       0.000000
25%       0.000000
50%       0.000000
75%       1.000000
max       1.000000

In [16]:
data.head(5)

                                                text  label_num
0  Subject: enron methanol ; meter # : 988291\r\n...          0
1  Subject: hpl nom for january 9 , 2001\r\n( see...          0
2  Subject: neon retreat\r\nho ho ho , we ' re ar...          0
3  Subject: photoshop , windows , office . cheap ...          1
4  Subject: re : indian springs\r\nthis deal is t...          0

In [17]:
x.shape

(5171,)

In [18]:
y.shape

(5171,)

In [19]:
X_train , Y_train = x[0:4000],y[0:4000]

In [20]:
X_text, Y_test = x[4000:], y[4000:]

# Future extrace

In [21]:
from sklearn.feature_extraction.text import CountVectorizer

In [22]:
vectorizer = CountVectorizer() # chuyển đổi định dạng text thành vector

In [24]:
transform_X_train = vectorizer.fit_transform(X_train.values).toarray() # chuyển X train về dạng array

In [25]:
train_vocab = vectorizer.vocabulary_ # export tập từ vựng

In [26]:
vectorizer = CountVectorizer(vocabulary=train_vocab)

In [27]:
transform_x_test = vectorizer.fit_transform(X_text).toarray()

In [28]:
from sklearn.naive_bayes import MultinomialNB

In [33]:
clf = MultinomialNB()

In [34]:
clf.fit(transform_X_train,Y_train)

MultinomialNB()

In [35]:
transform_x_test.shape

(1171, 44198)

In [36]:
transform_X_train.shape

(4000, 44198)

In [37]:
Y_train.shape

(4000,)

In [38]:
Y_fn = clf.predict(transform_x_test)

In [39]:
from sklearn.metrics import accuracy_score

In [41]:
print('Training size: %d, accuracy = %.2f%%'% \
     (X_train.shape[0],accuracy_score(Y_test,Y_fn)*100))

Training size: 4000, accuracy = 98.29%

In [65]:
from sklearn.model_selection import GridSearchCV

In [66]:

params = {'alpha': [0.5,0.6,0.7,0.8,0.9,1,1.1,1.2,1.3,1.4]}

In [67]:
clf = MultinomialNB()

In [68]:
clf = GridSearchCV(clf,params,cv=5)

In [69]:
clf.fit(transform_X_train,Y_train)

GridSearchCV(cv=5, estimator=MultinomialNB(),
             param_grid={'alpha': [0.5, 0.6, 0.7, 0.8, 0.9, 1, 1.1, 1.2, 1.3,
                                   1.4]})

In [70]:
best_clf = clf.best_estimator_

In [71]:
Y_pred = best_clf.predict(transform_x_test)

In [72]:
print('Training size = %d, accuracy = %.2f%%' % \
      (X_train.shape[0],accuracy_score(Y_test, Y_pred)*100))

Training size = 4000, accuracy = 98.04%

In [73]:
print(clf.best_params_)

{'alpha': 1.3}